songs/teenagedirtbag.org
#+TITLE: Wheatus - Teenage Dirtbag

* Lyrics
#+begin_example
Her name is Noelle
I have a dream about her
She rings my bell
I got gym class in half an hour
Oh, how she rocks
In Keds and tube socks
But she doesn't know who I am
And she doesn't give a damn about me

[Chorus]
'Cause I'm just a teenage dirtbag, baby
Yeah, I'm just a teenage dirtbag, baby
Listen to Iron Maiden, baby, with me, ooh

[Verse 2]
Her boyfriend's a dick
And he brings a gun to school
And he'd simply kick
My ass if he knew the truth
He lives on my block
And he drives an IROC
But he doesn't know who I am
And he doesn't give a damn about me

[Chorus]
'Cause I'm just a teenage dirtbag, baby
Yeah, I'm just a teenage dirtbag, baby
Listen to Iron Maiden, baby, with me, ooh

[Bridge]
Oh, yeah, dirtbag
No, she doesn't know what she's missin'
Oh, yeah, dirtbag
No, she doesn't know what she's missin'

[Verse 3]
Man, I feel like mold
It's prom night and I am lonely
Lo and behold
She's walkin' over to me
This must be fake
My lip starts to shake
How does she know who I am?
And why does she give a damn about me?
I've got two tickets to Iron Maiden, baby
Come with me Friday, don't say maybe
I'm just a teenage dirtbag, baby, like you

[Outro]
Oh, yeah, dirtbag
No, she doesn't know what she's missin'
Oh, yeah, dirtbag
No, she doesn't know what she's missin'..
#+end_example

