songs/teenagedirtbag.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="no" xml:lang="no">
<head>
<!-- 2023-09-22 Fri 18:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wheatus - Teenage Dirtbag</title>
<meta name="author" content="Tarjei Bærland" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Wheatus - Teenage Dirtbag</h1>
<div id="outline-container-org4df4448" class="outline-2">
<h2 id="org4df4448">Lyrics</h2>
<div class="outline-text-2" id="text-org4df4448">
<pre class="example" id="orga101436">
Her name is Noelle
I have a dream about her
She rings my bell
I got gym class in half an hour
Oh, how she rocks
In Keds and tube socks
But she doesn't know who I am
And she doesn't give a damn about me

[Chorus]
'Cause I'm just a teenage dirtbag, baby
Yeah, I'm just a teenage dirtbag, baby
Listen to Iron Maiden, baby, with me, ooh

[Verse 2]
Her boyfriend's a dick
And he brings a gun to school
And he'd simply kick
My ass if he knew the truth
He lives on my block
And he drives an IROC
But he doesn't know who I am
And he doesn't give a damn about me

[Chorus]
'Cause I'm just a teenage dirtbag, baby
Yeah, I'm just a teenage dirtbag, baby
Listen to Iron Maiden, baby, with me, ooh

[Bridge]
Oh, yeah, dirtbag
No, she doesn't know what she's missin'
Oh, yeah, dirtbag
No, she doesn't know what she's missin'

[Verse 3]
Man, I feel like mold
It's prom night and I am lonely
Lo and behold
She's walkin' over to me
This must be fake
My lip starts to shake
How does she know who I am?
And why does she give a damn about me?
I've got two tickets to Iron Maiden, baby
Come with me Friday, don't say maybe
I'm just a teenage dirtbag, baby, like you

[Outro]
Oh, yeah, dirtbag
No, she doesn't know what she's missin'
Oh, yeah, dirtbag
No, she doesn't know what she's missin'..
</pre>
</div>
</div>
</div>
</body>
</html>